bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/AT90USB646.xml
            <value-group caption="" name="ANALOG_ADC_PRESCALER">
                <value caption="2" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="ANALOG_ADC_AUTO_TRIGGER2">
                <value caption="Free Running mode" name="VAL_0x00" value="0x00"/>
                <value caption="Analog Comparator" name="VAL_0x01" value="0x01"/>
                <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
                <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
                <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
                <value caption="Timer/Counter1 Compare Match B" name="VAL_0x05" value="0x05"/>
                <value caption="Timer/Counter1 Overflow" name="VAL_0x06" value="0x06"/>
                <value caption="Timer/Counter1 Capture Event" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Analog Comparator" name="AC">
            <register-group caption="Analog Comparator" name="AC">
                <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
                    <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x40" name="ACME"/>
                </register>
                <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x50" size="1"
                          ocd-rw="R">
                    <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
                    <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
                    <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
                    <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
                    <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
                    <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
                    <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS"
                              values="ANALOG_COMP_INTERRUPT"/>
                </register>
                <register caption="" name="DIDR1" offset="0x7F" size="1">
                    <bitfield caption="AIN1 Digital Input Disable" mask="0x02" name="AIN1D"/>
                    <bitfield caption="AIN0 Digital Input Disable" mask="0x01" name="AIN0D"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_COMP_INTERRUPT">
                <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
                <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="Phase Locked Loop" name="PLL">
            <register-group caption="Phase Locked Loop" name="PLL">
                <register caption="PLL Status and Control register" name="PLLCSR" offset="0x49" size="1">
                    <bitfield caption="PLL prescaler Bits" mask="0x1C" name="PLLP" values="PLL_INPUT_PRESCALER"/>
                    <bitfield caption="PLL Enable Bit" mask="0x02" name="PLLE"/>
                    <bitfield caption="PLL Lock Status Bit" mask="0x01" name="PLOCK"/>
                </register>
            </register-group>
            <value-group caption="" name="PLL_INPUT_PRESCALER">
                <value caption="Clock/4" name="VAL_0x03" value="0x03"/>
                <value caption="Clock/8" name="VAL_0x05" value="0x05"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="QFP_QFN_64">
            <pin pad="PE6" position="1"/>
            <pin pad="PE7" position="2"/>
            <pin pad="UVCC" position="3"/>
            <pin pad="D-" position="4"/>
            <pin pad="D+" position="5"/>
            <pin pad="UGND" position="6"/>
            <pin pad="UCAP" position="7"/>
            <pin pad="VBUS" position="8"/>
            <pin pad="PE3" position="9"/>
            <pin pad="PB0" position="10"/>
            <pin pad="PB1" position="11"/>
            <pin pad="PB2" position="12"/>
            <pin pad="PB3" position="13"/>
            <pin pad="PB4" position="14"/>
            <pin pad="PB5" position="15"/>
            <pin pad="PB6" position="16"/>
            <pin pad="PB7" position="17"/>
            <pin pad="PE4" position="18"/>
            <pin pad="PE5" position="19"/>
            <pin pad="RESET" position="20"/>
            <pin pad="VCC" position="21"/>
            <pin pad="GDN" position="22"/>
            <pin pad="XTAL2" position="23"/>
            <pin pad="XTAL1" position="24"/>
            <pin pad="PD0" position="25"/>
            <pin pad="PD1" position="26"/>
            <pin pad="PD2" position="27"/>
            <pin pad="PD3" position="28"/>
            <pin pad="PD4" position="29"/>
            <pin pad="PD5" position="30"/>
            <pin pad="PD6" position="31"/>
            <pin pad="PD7" position="32"/>
            <pin pad="PE0" position="33"/>
            <pin pad="PE1" position="34"/>
            <pin pad="PC0" position="35"/>
            <pin pad="PC1" position="36"/>
            <pin pad="PC2" position="37"/>
            <pin pad="PC3" position="38"/>
            <pin pad="PC4" position="39"/>
            <pin pad="PC5" position="40"/>
            <pin pad="PC6" position="41"/>
            <pin pad="PC7" position="42"/>
            <pin pad="PE2" position="43"/>
            <pin pad="PA7" position="44"/>
            <pin pad="PA6" position="45"/>
            <pin pad="PA5" position="46"/>
            <pin pad="PA4" position="47"/>
            <pin pad="PA3" position="48"/>
            <pin pad="PA2" position="49"/>
            <pin pad="PA1" position="50"/>
            <pin pad="PA0" position="51"/>
            <pin pad="VCC" position="52"/>
            <pin pad="GND" position="53"/>
            <pin pad="PF7" position="54"/>
            <pin pad="PF6" position="55"/>
            <pin pad="PF5" position="56"/>
            <pin pad="PF4" position="57"/>
            <pin pad="PF3" position="58"/>
            <pin pad="PF2" position="59"/>
            <pin pad="PF1" position="60"/>
            <pin pad="PF0" position="61"/>
            <pin pad="AREF" position="62"/>
            <pin pad="GND" position="63"/>
            <pin pad="AVCC" position="64"/>
        </pinout>
    </pinouts>
</target-description-file>
